Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeTypeRefsWarning
Cannot create reference objects for a DirectShapeType.

Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeRefsWarning
Cannot create reference objects for a DirectShape.